#include <stdio.h>  //导入头部文件
int main(){  //函数头
  int x;  //定义整型变量
  char c;  //定义字符型变量
  int a,b;  //定义两个整型变量a,b
  int year;  //定义整形变量year
  scanf("%d%c",&x,&c);  //输入接收函数接收两个参数x,c
  printf("%d\t",x>2);  //输出整型格式数据x>2为真输出1否则输出0
  printf("%d\n",c>='a');  //输出整型格式后换行，c>=字符串a为真输出1，否则输出0
  scanf("%d%d%d",&a,&b,&year);  //输入接收函数，接收三个整型参数
  printf("%d\t",a*b==6*2);  //输出整型格式后加空格，表达式结果为真输出1否则输出0
  printf("%d\n",year%4==0);  //输出整型数据后换行，表达式结果为真输出1否则输出0
  printf("老师教的太好了！\n");  //输出一段话
  return 0;  //函数返回值
}