#include <stdio.h>
int main(){
int i,j;  /*定义外层和内层的计数器变量*/
float g,sum,ave;  /*设置三个浮点变量，g表示内层循环需要输入的分数，sum表示内层循环分数相加的和，ave表示求平均数*/
printf("请输入学生各门课成绩：\n");
for(i=1;i<=3;i++){  /*外层循环，设置从1开始循环到3,外层循环3次*/
  sum=0.0;  /*设置求和基数为零，每次重新开始循环成绩求和数都为零。*/
  for(j=1;j<=5;j++){  /*设置内层循环，j为循环计数，从1开始循环到5，循环5次，每循环一次加1*/
    scanf("%f",&g);  /*获取输入成绩，设置循环5次输入*/
    sum+=g;  /*把5次输入的值求和，表达式相当于sum = sum + g，把每次输入的数据相加求和后赋值*/
  }
  ave=sum/5;  /*求5次求和SUM的平均数*/
  printf("第 %d 位同学的5门课程的总成绩和平均成绩为：%8.2f%8.2f,\n",i,sum,ave);
}
return 0;
}