#include <stdio.h>
#define N 5  /*定义常量5作为二维数组的行数*/
int main()
{
	int a[N][7]; /*定义一个N行7列的数组，N是定义的常量*/
	int i,j;
	char c;
	printf("输入四列数据：学号、数学、语文、英语：");
	for(i=0;i<N;i++)
	{
		for(j=0;j<4;j++)
		{
		  scanf("%d",&a[i][j]);
		}
	}
	printf("处理输入的行业数据（三列相加）：\n");
	for(i=0;i<N;i++)
	{
		for(a[i][4]=0,j=1;j<4;j++)  /*设置求和列初始值为0，开始循环从下标1开始到最后一门成绩的列，共循环三列的互数据*/
		{
		  a[i][4]+=a[i][j]; /*当前行指定的列显示列的求和，先加再赋值，指定求和列+当前行的指定列然后赋值给求和的指定列列*/
		}
		a[i][5]=a[i][4]/3;
		if(a[i][1]>=90&&a[i][2]>=90&&a[i][3]>=90)  /*满足三个条件则把参数赋值给第六列*/
		{
		  a[i][6]=1;  /*如果三门课成绩都大于等于90，则当前行的指定列下标参数为1*/
		}
		else
		{ 
			a[i][6]=0;  /*不满足三门都90以上赋值0*/ 
		}
	}
	printf("输出成绩表\n");
	printf("NO. MT EN PH SUM AVG >90\n");
	printf("--------------------------------\n");
	for(i=0;i<N;i++)
	{
		for(j=0;j<7;j++)
		{
		  printf("%6d",a[i][j]);
		}
		printf("\n");
	}
return 0;
}