#include <stdio.h>
int main()
{
	int a[5]={33,55,22,11,44};  /*定义一个整型数组，长度为5并赋值*/
	int i,j,t,n;  /*定义三个变量，i用于循环计数，初始化计数器为0，与数组下标同步。j为循环轮数变量。t为交换时暂存当前的循环元素。*/
	n=sizeof(a)/sizeof(a[0]);  /*获取数组长度n*/
	printf("当前数组长度：%d\n",n);
	printf("未排序元素序列：");
	for(i=0;i<n;i++)
	{
	  printf("%-3d",a[i]);
	}
	/*开始元素排序*/
	for(j=0;j<n-1;j++)  /*J为循环需要的轮数起点为数组下标0开始，当j轮数小于(n-1-j)轮时，轮数自增*/
	{
		for(i=0;i<n-1-j;i++)  /*内层循环每轮需要的对比次数*/
		{
			if(a[i]<a[i+1])  /*判断下当前内循环每轮对比的两个参数，如果上一位小于下一位*/
			{
			  t=a[i];  /*保存下当前循环元素*/
			  a[i]=a[i+1];  /*当前元素的下一位赋值给当前元素*/
			  a[i+1]=t;  /*把之前保存的当前元素赋值给当前元素的下一位，完成为止调换*/
			}
		}
	}
	printf("\n");
	/*输出排序后的元素排序*/
	for(i=0;i<n;i++)  /*循环一维数组列出排序后的数位*/
	{
	  printf("%-3d",a[i]);
	}
    printf("\n");
return 0;
}