#include <stdio.h>
int main(){
	int a[5]={1,6,3,4,9};  //定义一个长度为5的数组并赋值
	int i,j,t; /*定义i为基础遍历计数器，j为循环轮数计数器，t为当前参数暂存器*/
	printf("输出当前未排序数组参数：\n");
	for(i=0;i<5;i++)
	{
	  printf("%3d",a[i]);
	}
	printf("\n");
	for(j=0;j<4;j++)  /*进行轮数循环*/
		for(i=0;i<4-j;i++)  /*循环比较次数*/
			if(a[i]<a[i+1])  /*判断如果当前参数大于下一位*/
			{
			  t=a[i];  /*当前参数赋值给t*/
			  a[i]=a[i+1];  /*当前参数的下一参数赋值给当前参数*/
			  a[i+1]=t;  /*之前保存的当前参数赋值给下一位参数，交换位置*/
			}
			printf("排序后，5个数的顺序：\n");
			for(i=0;i<5;i++)
			{
			  printf("%3d",a[i]);
			}
printf("\n");
return 0;
}