#include <stdio.h>
int main(){
	int a[]={78,89,54,34,67,58,63,90,26,93};  /*声明一个整型空数组，指定10个数组参数*/
	int i;  /*数组下标计数器，标识数组下标从0开始*/
    printf("更新之前学生的成绩：\n");
	for(i=0;i<10;i++)  /*循环遍历长度为10的数组元素，i为当前数组元素下标对应的数字*/
	{printf("%3d",a[i]); } /*输出当前数组元素，元素位宽限制到3位*/
	printf("\n");
	for(i=9;i>=0;i--)  /*遍历9到0的10个数，从最大的数开始向0递减，每次运行后减一*/
	{
	  	if(a[i]>=55&&a[i]<60)  /*判断一下遍历的数组参数，当前参数如果大于等于55同时小于60*/
		{
		  a[i]=60;  /*找到条件合适的数组参数，重新赋值*/
		}
	}
printf("输出修改后的学生成绩：\n");
for(i=0;i<10;i++)  /*遍历数组使用i计数器从0开始到小于10的10个数，每运行一次输出一次当前i值对应的数组下标*/
{
  printf("%3d",a[i]);
}
printf("\n");
return 0;
}