#include <stdio.h>
int main(){
	int a[10]={78,89,54,34,67,58,63,90,26,93};  /*定义一个整型数组，长度为10,且全部赋值*/
	int i,max=a[0],min=a[0],sum=0;  /*定义i计数器，定义一个假设，max最大数和min最小数都是数组的0位下标，定义一个求和变脸sum并给初始值为0，方便下面进行累加计算*/
	float ave;  /*定义一个浮点型变量用于保存计算平均值的参数*/
	for(i=0;i<10;i++)  /*遍历一维数组长度为10位，从0开始遍历*/
	{
		if(a[i]>max)  /*判断当前遍历参数如果大于假设的数组首位数max则*/
		{
		  max=a[i];  /*把符合条件的当前遍历的数组参数赋值给最大值变量*/
		}
		if(a[i]<min)  /*判断如果当前遍历的值小于假设的当前最小值（数组的第一个参数）*/
		{
		  min=a[i];  /*把满足条件的当前值赋值给指定的最小值变量min*/
		}
		sum+=a[i];  /*每循环一次当前数组参数自动累加并赋值给求和变量sum*/
	}
	ave=sum/10.0;  /*平均数等于SUM累加和除以数组总长度，这里的10.0表示变量后面是浮点表达式，之前已经对变量进行float声明*/
	printf("当前学生的成绩：\n");
	for(i=0;i<10;i++)  /*循环输出当前数组参数，3d为表示输出整型为3位*/
	{
	  printf("%3d",a[i]);  /*输出当前遍历元素*/
	}
	printf("\n");
	printf("当前成绩的最大值是：%d\n",max);
	printf("当前成绩的最小值是：%d\n",min);
	printf("当前成绩的总成绩是：%d\n",sum);
	printf("当前成绩的平均数是：%4.2f\n",ave);
return 0;
}