#include <stdio.h>
int main(){
	int a[5]={1,6,3,7,9};  /*定义一个数组，长度为5并赋参数*/
	int i,j,k,n;  /*定义四个变量，i为每轮对比元素的下标数，j为对比轮数（n-1),k为当前对比最大数下标，n为数组长度变量*/
	int t; /*定义当前对比数据暂存*/
	n=sizeof(a)/sizeof(a[0]);
	printf("选择排序法\n");
	printf("排序前数据：");
	for(i=0;i<n;i++)
	{
	  printf("%-3d",a[i]);
	}
	printf("\n");
    for(j=0;j<n-1;j++) /*循环外层查找轮数*/
	{
		k=j;  /*j代表循环轮数，从下标0开始，意思是默认首位数下标[0]为当前最大数*/
		for(i=j+1;i<=n-1;i++) /*内循环找出每轮需要对比的次数，计数范围i下标从j+1开始(内循环对比从序列的下标第二位[1]开始)，终值为数组长度最后一位数的下标(比如长度为5,小于等于1的长度就是4，需要对比的范围就是a[1]-a[4])*/
		{
			if(a[i]>a[k])  /*判断如果当前的参数大于当前轮的最大数*/
			{
			  k=i;  /*把当前数赋值给当前轮找到的最大数k*/
			}
		}
		if(k>j)  /*如果找到的最大数下标大于当前轮数下标*/
		{
		  t=a[k];  /*暂存当前最大数下标*/
		  a[k]=a[j];  /*本轮最大赋值给当前最大数*/
		  a[j]=t;  /*暂存的之前本轮最大给当*/
		}
	}
	printf("排序后的数据：");
	for(i=0;i<n;i++)
	{
	  printf("%-3d",a[i]);
	}
	printf("\n");
	return 0;
}